wengubing/agv_gd32h7/野火gd32h7/ebf_gd32h7_Development_Board_factory_test_program/User/sdram/bsp_exmc_sdram.c
    /* step 8 : set the auto-refresh rate counter--------------------------------*/
    /* 64ms, 8192-cycle refresh, 64ms/8192=7.81us */
    /* SDCLK_Freq = SYS_Freq/2 */
    /* (7.81 us * SDCLK_Freq) - 20 */
    exmc_sdram_refresh_count_set(1542);

    /* wait until the SDRAM controller is ready */
    timeout = SDRAM_TIMEOUT;
    while((exmc_flag_get(sdram_device, EXMC_SDRAM_FLAG_NREADY) != RESET) && (timeout > 0)) {
        timeout--;
    }
}
/*!
    \brief      fill the buffer with specified value
    \param[in]  pbuffer: pointer to the buffer to fill data
    \param[in]  buffer_lengh: size of the buffer to fill
    \param[in]  start_value: first data to fill in the buffer
    \param[out] none
    \retval     none
*/
void fill_buffer(uint8_t *pbuffer, uint16_t buffer_lengh, uint16_t start_value)
{
    uint16_t index = 0;

    /* fill the buffer with specified values */
    for(index = 0; index < buffer_lengh; index++) {
        pbuffer[index] = (uint8_t)(index + start_value);
    }
}

/*!
    \brief      write a byte buffer(data is 8 bits) to the EXMC SDRAM memory
    \param[in]  sdram_device: specify which a SDRAM memory block is written
    \param[in]  pbuffer: pointer to buffer
    \param[in]  write_addr: SDRAM memory internal address from which the data will be written
    \param[in]  byte_count_to_write: number of bytes to write
    \param[out] none
    \retval     none
*/
void sdram_writebuffer(uint32_t sdram_device, uint8_t *pbuffer, uint32_t write_addr, uint32_t byte_count_to_write)
{
    uint32_t temp_addr;

    /* select the base address according to EXMC_Bank */
    if(sdram_device == EXMC_SDRAM_DEVICE0) {
        temp_addr = SDRAM_DEVICE0_ADDR;
    } else {
        temp_addr = SDRAM_DEVICE1_ADDR;
    }

    /* while there is data to write */
    for(; byte_count_to_write != 0; byte_count_to_write--) {
        /* transfer data to the memory */
        *(uint8_t *)(temp_addr + write_addr) = *pbuffer++;

        /* increment the address */
        write_addr += 1;
    }
}

/*!
    \brief      read a block of 8-bit data from the EXMC SDRAM memory
    \param[in]  sdram_device: specify which a SDRAM memory block is written
    \param[in]  pbuffer: pointer to buffer
    \param[in]  read_addr: SDRAM memory internal address to read from
    \param[in]  byte_count_to_read: number of bytes to read
    \param[out] none
    \retval     none
*/
void sdram_readbuffer(uint32_t sdram_device, uint8_t *pbuffer, uint32_t read_addr, uint32_t byte_count_to_read)
{
    uint32_t temp_addr;

    /* select the base address according to EXMC_Bank */
    if(sdram_device == EXMC_SDRAM_DEVICE0) {
        temp_addr = SDRAM_DEVICE0_ADDR;
    } else {
        temp_addr = SDRAM_DEVICE1_ADDR;
    }

    /* while there is data to read */
    for(; byte_count_to_read != 0; byte_count_to_read--) {
        /* read a byte from the memory */
        *pbuffer++ = *(uint8_t *)(temp_addr + read_addr);

        /* increment the address */
        read_addr += 1;
    }
}

/*!
    \brief      fill the buffer with specified value
    \param[in]  pbuffer: pointer to the buffer to fill data
    \param[in]  buffer_lengh: size of the buffer to fill
    \param[in]  start_value: first data to fill in the buffer
    \param[out] none
    \retval     none
*/
void fill_buffer8(uint8_t *pbuffer, uint16_t buffer_lengh, uint16_t start_value)
{
    uint16_t index = 0;

    /* fill the buffer with specified values */
    for(index = 0; index < buffer_lengh; index++) {
        pbuffer[index] = (uint8_t)(index + start_value);
    }
}

/*!
    \brief      fill the buffer with specified value
    \param[in]  pbuffer: pointer to the buffer to fill data
    \param[in]  buffer_lengh: size of the buffer to fill
    \param[in]  start_value: first data to fill in the buffer
    \param[out] none
    \retval     none
*/
void fill_buffer16(uint16_t *pbuffer, uint32_t buffer_lengh, uint32_t start_value)
{
    uint16_t index = 0;

    /* fill the buffer with specified values */
    for(index = 0; index < buffer_lengh; index++) {
        pbuffer[index] = (uint16_t)(index + start_value);
    }
}

/*!
    \brief      fill the buffer with specified value
    \param[in]  pbuffer: pointer to the buffer to fill data
    \param[in]  buffer_lengh: size of the buffer to fill
    \param[in]  start_value: first data to fill in the buffer
    \param[out] none
    \retval     none
*/
void fill_buffer32(uint32_t *pbuffer, uint32_t buffer_lengh, uint32_t start_value)
{
    uint16_t index = 0;

    /* fill the buffer with specified values */
    for(index = 0; index < buffer_lengh; index++) {
        pbuffer[index] = (uint32_t)(index + start_value);
    }
}

/*!
    \brief      write a byte buffer(data is 8 bits) to the EXMC SDRAM memory
    \param[in]  sdram_device: specify which a SDRAM memory block is written
    \param[in]  pbuffer: pointer to buffer
    \param[in]  write_addr: SDRAM memory internal address from which the data will be written
    \param[in]  byte_count_to_write: number of bytes to write
    \param[out] none
    \retval     none
*/
void sdram_writebuffer_8(uint32_t sdram_device, uint8_t *pbuffer, uint32_t write_addr, uint32_t byte_count_to_write)
{
    uint32_t temp_addr;

    /* select the base address according to EXMC_Bank */
    if(sdram_device == EXMC_SDRAM_DEVICE0) {
        temp_addr = SDRAM_DEVICE0_ADDR;
    } else {
        temp_addr = SDRAM_DEVICE1_ADDR;
    }

    /* while there is data to write */
    for(; byte_count_to_write != 0; byte_count_to_write--) {
        /* transfer data to the memory */
        *(uint8_t *)(temp_addr + write_addr) = *pbuffer++;

        /* increment the address */
        write_addr += 1;
    }
}

/*!
    \brief      write a byte buffer(data is 16 bits) to the EXMC SDRAM memory
    \param[in]  sdram_device: specify which a SDRAM memory block is written
    \param[in]  pbuffer: pointer to buffer
    \param[in]  write_addr: SDRAM memory internal address from which the data will be written
    \param[in]  byte_count_to_write: number of bytes to write
    \param[out] none
    \retval     none
*/
void sdram_writebuffer_16(uint32_t sdram_device, uint16_t *pbuffer, uint32_t write_addr, uint32_t byte_count_to_write)
{
    uint32_t temp_addr;

